//EBUD0RUN JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=NOLIMIT,REGION=0M,COND=(16,LT)
//*
//*     Verify the names of the STEPLIB and INPUT datasets
//*
//STEP1    EXEC PGM=EBUD01
//******* ADDITIONAL RUNTIME JCL HERE ******
//STEPLIB  DD DISP=SHR,DSN=CEE.SCEERUN
//        DD    DISP=SHR,DSN=FEL.SFELLOAD
//        DD    DISP=SHR,DSN=EQAW.SEQAMOD
//        DD    DISP=SHR,DSN=IBMUSER.DBB.USERBLD.LOAD
//INPUT DD DISP=SHR,DSN=IBMUSER.RETCALC.INPUT,
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//
