//EBUD0RUN JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=NOLIMIT,REGION=0M,COND=(16,LT)
//*        JCLLIB ORDER=(RATCFG.IDZ.V14R2.#CUST.PROCLIB)
//*
//STEP1    EXEC PGM=EBUD01
//******* ADDITIONAL RUNTIME JCL HERE ******
//STEPLIB  DD DISP=SHR,DSN=CEE.SCEERUN
//        DD    DISP=SHR,DSN=RDZ.V16.SFELLOAD
//        DD    DISP=SHR,DSN=DEBUG.V16.SEQAMOD
//        DD    DISP=SHR,DSN=BRICE.DBB.WF.USERBLD.LOAD
//INPUT DD DISP=SHR,DSN=RATCFG.RETCALC.INPUT,
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//