          05 DATE-AREA.
                07  IN-CCYY       PIC 9(4).
                07  IN-MM         PIC 9(2).
                07  IN-DD         PIC 9(2).
           05  FILLER        PIC X(72).